{
  "technology": [
    {
      "title": "Heraldsun.com.au | Subscribe to the Herald Sun for exclusive stories",
      "summary": "AI-powered “co-bots” are being rolled out at Victorian grocery stores and the US-based company that makes the machines has explained how they will affect local workers. AI-powered “co-bots” are being rolled out at Victorian grocery stores and the US-based company that makes the machines has explaine...",
      "category": "technology",
      "source": "www.heraldsun.com.au",
      "url": "https://www.heraldsun.com.au/news/victoria/melbournes-new-cleaning-robots-will-use-ai-sophisticated-sensors-and-hitech-cameras/news-story/b53912b190bf9de64409d54a4aa92013"
    },
    {
      "title": "Samsung OLED S95 televisions, Q-Series Q990F Soundbar hit Australian market | news.com.au — Australia’s leading news site",
      "summary": "The latest instalment of Samsung’s pioneering OLED range has hit the market, offering surreal visuals and an ethereal soundscapes experience for viewers in every room size. There’s nothing better than being in the grips of a thrilling television show where you’re held ransom to the weekly drop of ep...",
      "category": "technology",
      "source": "www.news.com.au",
      "url": "https://www.news.com.au/technology/home-entertainment/tv/samsung-oled-s95-televisions-qseries-q990f-soundbar-hit-australian-market/news-story/491b5d2d657d2b7ab2a9d603d04debf4"
    },
    {
      "title": "New ‘breed’ of bike arrives in Aus: 2025 PAPRIKA 53 | news.com.au — Australia’s leading news site",
      "summary": "A powerful new e-bike ever has just arrived in Australia and it’s going to make a lot of people very happy. PAPRIKA 53 believe they’ve revolutionised the entire gravel bike industry following their latest launch of the Model 25 GT. It’s the world’s first DJI-powered e-gravel bike that’s turning head...",
      "category": "technology",
      "source": "www.news.com.au",
      "url": "https://www.news.com.au/technology/motoring/on-the-road/2025-paprika-53-model-25-gt-worlds-first-gravel-ebike-launches-in-australia/news-story/94a2cf1ae4b5ecad05b4b339e4bacc78"
    }
  ],
  "lifestyle": [
    {
      "title": "Little-known Aussie company takes on China in rare minerals trade war | news.com.au — Australia’s leading news site",
      "summary": "China has been smashed in the tariff trade war with the US and now Australia is threatening its dominance in a very lucrative industry. The brutal trade war between China and the United States has hit a number of industries, but 31 critical minerals, including rare earth elements, were exempted from...",
      "category": "lifestyle",
      "source": "www.news.com.au",
      "url": "https://www.news.com.au/technology/innovation/littleknown-aussie-company-takes-on-china/news-story/ff6bf117ef94a0282d2cf0300c93c239"
    },
    {
      "title": "Queen's Platinum Jubilee - Behind The News",
      "summary": "Crowns. Cakes. And corgis, in crowns, with cakes.",
      "category": "lifestyle",
      "source": "www.abc.net.au",
      "url": "https://www.abc.net.au/news/2025-05-18/lynas-rare-earths-breakthrough/13912346"
    }
  ],
  "music": [
    {
      "title": "Austrians celebrate JJ bringing home first Eurovision win in 11 years | Eurovision 2025 | The Guardian",
      "summary": "Austrian-Filipino countertenor praised for melding techno with country’s rich operatic tradition in song Wasted Love Austrians have been celebrating JJ, an Austrian-Filipino countertenor lauded for “singing Austria into the spotlight” after bringing home the country’s first Eurovision song contest v...",
      "category": "music",
      "source": "www.theguardian.com",
      "url": "https://www.theguardian.com/tv-and-radio/2025/may/18/austrians-celebrate-jj-bringing-home-first-eurovision-win-in-11-years"
    },
    {
      "title": "Australia’s Go-Jo misses out on Eurovision final berth | news.com.au — Australia’s leading news site",
      "summary": "Australia’s Eurovision contestant has been eliminated from the 2025 competition, breaking the hearts of diehard fans for the second year in a row. Australia’s diehard Eurovision fans have had their hearts broken again with Go-Jo failing to advance to the grand final. The indie pop artist Go-Jo deliv...",
      "category": "music",
      "source": "www.news.com.au",
      "url": "https://www.news.com.au/entertainment/music/australias-gojo-out-of-the-2025-eurovision-grand-final-in-a-stacked-semi/news-story/c323ed0ae37a6ff3687a04485b32bcf7"
    },
    {
      "title": "Sam Fender announces 2025 'People Watching' tour in Australia",
      "summary": "He will be supported by former NME cover star Holly Humberstone Sam Fender is heading Down Under for the ‘People Watching’ tour later this year – see the full list of tour dates and ticketing details below. Fender has announced his return to Australia after a series of sold-out shows in 2022 and 202...",
      "category": "music",
      "source": "www.nme.com",
      "url": "https://www.nme.com/news/music/sam-fender-2025-australia-people-watching-tour-dates-tickets-3862851"
    }
  ],
  "finance": [
    {
      "title": "Refinancing surge expected across SA following RBA decision - realestate.com.au",
      "summary": "Jessica Brown First published 19 May 2025, 5:00am A surge in SA homeowners and investors rushing to the bank to refinance is expected if rates are once again cut on Tuesday. Many have already done so, with finance brokerage Loan Market recording a 32.7 per cent increase in refinancing applications f...",
      "category": "finance",
      "source": "www.adelaidenow.com.au",
      "url": "https://www.adelaidenow.com.au/real-estate/south-australia/adelaide/refinancing-surge-expected-across-sa-following-rba-decision/news-story/99b24a8c598fbc045abf52a401ab1927"
    }
  ],
  "environment": [
    {
      "title": "Domino’s ANZ CEO Kerri Hayman resigns after just nine months | news.com.au — Australia’s leading news site",
      "summary": "Embattled pizza giant Domino’s has announced it is looking for a new top boss in Australia after its chief executive resigned less than a year into the job. Domino’s Pizza Australia and New Zealand chief executive Kerri Hayman has abruptly resigned after just nine months in the top job. In a stateme...",
      "category": "environment",
      "source": "www.news.com.au",
      "url": "https://www.news.com.au/finance/business/dominos-australia-new-zealand-boss-announces-shock-resignation/news-story/d12258fa00bb9d34879255cf13789308"
    }
  ],
  "crime": [
    {
      "title": "Redfern: Woman fighting for life after alleged domestic violence assault | news.com.au — Australia’s leading news site",
      "summary": "Police have given an update on an alleged domestic violence incident in Sydney as a critically injured woman fights for life in hospital. A man has been charged after a woman was critically injured in an alleged domestic violence assault in inner Sydney. The 47-year-old woman was rushed to Royal Pri...",
      "category": "crime",
      "source": "www.news.com.au",
      "url": "https://www.news.com.au/national/nsw-act/news/woman-fighting-for-life-after-alleged-domestic-violence-assault/news-story/ff2ef4391acb67de34bea7dce26cbb6b"
    }
  ],
  "politics": [
    {
      "title": "Abortion a matter for states, territories: Liberal senator Anne Ruston | news.com.au — Australia’s leading news site",
      "summary": "A key issue affecting women could be up for debate as the Coalition rethinks its national platform in the wake of its brutal election defeat. A senior Liberal senator has not confirmed if the Coalition’s position on abortion could change, as the opposition rethinks its national platform in the wake ...",
      "category": "politics",
      "source": "www.news.com.au",
      "url": "https://www.news.com.au/national/politics/abortion-a-matter-for-states-territories-liberal-senator-anne-ruston/news-story/28500d0e0f49ab0ebb6964249ed5eba7"
    }
  ]
}